
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        7 |          46 |            1 |
## Affected resources by action

|  Action  | Resources                                                                                                   |
|:--------:|:------------------------------------------------------------------------------------------------------------|
|    🟢    | `module.infrahouse-github-backup.aws_s3_bucket.infrahouse-backup-logs`                                      |
|    🟢    | `module.infrahouse-github-backup.aws_s3_bucket_lifecycle_configuration.infrahouse-backup`                   |
|    🟢    | `module.infrahouse-github-backup.aws_s3_bucket_lifecycle_configuration.infrahouse-backup-logs`              |
|    🟢    | `module.infrahouse-github-backup.aws_s3_bucket_logging.infrahouse-backup`                                   |
|    🟢    | `module.infrahouse-github-backup.aws_s3_bucket_public_access_block.infrahouse-backup-logs`                  |
|    🟢    | `module.infrahouse-github-backup.aws_s3_bucket_server_side_encryption_configuration.infrahouse-backup-logs` |
|    🟢    | `module.infrahouse-github-backup.aws_s3_bucket_versioning.infrahouse-backup-logs`                           |
|    🟡    | `module.ih8_tf_template.github_repository.repo`                                                             |
|    🟡    | `module.ih_tf_template.github_repository.repo`                                                              |
|    🟡    | `module.infrahouse-github-backup.aws_s3_bucket_server_side_encryption_configuration.default`                |
|    🟡    | `module.repos["aws-control"].github_repository.repo`                                                        |
|    🟡    | `module.repos["aws-control-289256138624"].github_repository.repo`                                           |
|    🟡    | `module.repos["aws-control-303467602807"].github_repository.repo`                                           |
|    🟡    | `module.repos["aws-control-493370826424"].github_repository.repo`                                           |
|    🟡    | `module.repos["cookiecutter-github-control"].github_repository.repo`                                        |
|    🟡    | `module.repos["hiera-aws-sm"].github_repository.repo`                                                       |
|    🟡    | `module.repos["homebrew-infrahouse-toolkit"].github_repository.repo`                                        |
|    🟡    | `module.repos["infrahouse-com"].github_repository.repo`                                                     |
|    🟡    | `module.repos["infrahouse-puppet-data"].github_repository.repo`                                             |
|    🟡    | `module.repos["infrahouse-toolkit"].github_repository.repo`                                                 |
|    🟡    | `module.repos["infrahouse-website-infra"].github_repository.repo`                                           |
|    🟡    | `module.repos["prometheus-elasticsearch-exporter"].github_repository.repo`                                  |
|    🟡    | `module.repos["proxysql-sandbox"].github_repository.repo`                                                   |
|    🟡    | `module.repos["puppet-code"].github_repository.repo`                                                        |
|    🟡    | `module.repos["terraform-aws-actions-runner"].github_repository.repo`                                       |
|    🟡    | `module.repos["terraform-aws-aerospike"].github_repository.repo`                                            |
|    🟡    | `module.repos["terraform-aws-bookstack"].github_repository.repo`                                            |
|    🟡    | `module.repos["terraform-aws-ci-cd"].github_repository.repo`                                                |
|    🟡    | `module.repos["terraform-aws-cloud-init"].github_repository.repo`                                           |
|    🟡    | `module.repos["terraform-aws-cost-alert"].github_repository.repo`                                           |
|    🟡    | `module.repos["terraform-aws-debian-repo"].github_repository.repo`                                          |
|    🟡    | `module.repos["terraform-aws-ecs"].github_repository.repo`                                                  |
|    🟡    | `module.repos["terraform-aws-elasticsearch"].github_repository.repo`                                        |
|    🟡    | `module.repos["terraform-aws-gh-identity-provider"].github_repository.repo`                                 |
|    🟡    | `module.repos["terraform-aws-gha-admin"].github_repository.repo`                                            |
|    🟡    | `module.repos["terraform-aws-github-backup"].github_repository.repo`                                        |
|    🟡    | `module.repos["terraform-aws-github-backup-configuration"].github_repository.repo`                          |
|    🟡    | `module.repos["terraform-aws-github-role"].github_repository.repo`                                          |
|    🟡    | `module.repos["terraform-aws-instance-profile"].github_repository.repo`                                     |
|    🟡    | `module.repos["terraform-aws-jumphost"].github_repository.repo`                                             |
|    🟡    | `module.repos["terraform-aws-kibana"].github_repository.repo`                                               |
|    🟡    | `module.repos["terraform-aws-openvpn"].github_repository.repo`                                              |
|    🟡    | `module.repos["terraform-aws-postfix"].github_repository.repo`                                              |
|    🟡    | `module.repos["terraform-aws-pypiserver"].github_repository.repo`                                           |
|    🟡    | `module.repos["terraform-aws-secret"].github_repository.repo`                                               |
|    🟡    | `module.repos["terraform-aws-secret-policy"].github_repository.repo`                                        |
|    🟡    | `module.repos["terraform-aws-service-network"].github_repository.repo`                                      |
|    🟡    | `module.repos["terraform-aws-state-bucket"].github_repository.repo`                                         |
|    🟡    | `module.repos["terraform-aws-state-manager"].github_repository.repo`                                        |
|    🟡    | `module.repos["terraform-aws-tags-override"].github_repository.repo`                                        |
|    🟡    | `module.repos["terraform-aws-terraformer"].github_repository.repo`                                          |
|    🟡    | `module.repos["terraform-aws-update-dns"].github_repository.repo`                                           |
|    🟡    | `module.repos["terraform-aws-website-pod"].github_repository.repo`                                          |
|    🔴    | `module.infrahouse-github-backup.aws_s3_object.check_file`                                                  |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.ih8_tf_template.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-template"
        name                        = "terraform-template"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ih_tf_template.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-template"
        name                        = "terraform-template"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infrahouse-github-backup.aws_s3_bucket.infrahouse-backup-logs will be created
  + resource "aws_s3_bucket" "infrahouse-backup-logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "infrahouse-backup-logs-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "created_by" = "infrahouse8/github-control"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.infrahouse-github-backup.aws_s3_bucket_lifecycle_configuration.infrahouse-backup will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "infrahouse-backup" {
      + bucket                                 = "infrahouse-backup-20241007015742534300000002"
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = (known after apply)

      + rule {
          + id     = "delete-old"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 7
            }
        }
    }

  # module.infrahouse-github-backup.aws_s3_bucket_lifecycle_configuration.infrahouse-backup-logs will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "infrahouse-backup-logs" {
      + bucket                                 = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = (known after apply)

      + rule {
          + id     = "delete-old"
          + status = "Enabled"

          + expiration {
              + days                         = 360
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + prefix = "access-log/"
            }
        }
    }

  # module.infrahouse-github-backup.aws_s3_bucket_logging.infrahouse-backup will be created
  + resource "aws_s3_bucket_logging" "infrahouse-backup" {
      + bucket        = "infrahouse-backup-20241007015742534300000002"
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "access-log/"
    }

  # module.infrahouse-github-backup.aws_s3_bucket_public_access_block.infrahouse-backup-logs will be created
  + resource "aws_s3_bucket_public_access_block" "infrahouse-backup-logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.infrahouse-github-backup.aws_s3_bucket_server_side_encryption_configuration.default will be updated in-place
  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
        id                    = "infrahouse-backup-20241007015742534300000002"
        # (2 unchanged attributes hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.infrahouse-github-backup.aws_s3_bucket_server_side_encryption_configuration.infrahouse-backup-logs will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "infrahouse-backup-logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.infrahouse-github-backup.aws_s3_bucket_versioning.infrahouse-backup-logs will be created
  + resource "aws_s3_bucket_versioning" "infrahouse-backup-logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Disabled"
        }
    }

  # module.infrahouse-github-backup.aws_s3_object.check_file will be destroyed
  # (because aws_s3_object.check_file is not in configuration)
  - resource "aws_s3_object" "check_file" {
      - arn                           = "arn:aws:s3:::infrahouse-backup-20241007015742534300000002/.github" -> null
      - bucket                        = "infrahouse-backup-20241007015742534300000002" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "text/plain" -> null
      - etag                          = "d41d8cd98f00b204e9800998ecf8427e" -> null
      - force_destroy                 = false -> null
      - id                            = ".github" -> null
      - key                           = ".github" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "created_by" = "infrahouse8/github-control"
        } -> null
      - version_id                    = "null" -> null
        # (13 unchanged attributes hidden)
    }

  # module.repos["aws-control"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "aws-control"
        name                        = "aws-control"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["aws-control-289256138624"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "aws-control-289256138624"
        name                        = "aws-control-289256138624"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["aws-control-303467602807"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "aws-control-303467602807"
        name                        = "aws-control-303467602807"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["aws-control-493370826424"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "aws-control-493370826424"
        name                        = "aws-control-493370826424"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["cookiecutter-github-control"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "cookiecutter-github-control"
        name                        = "cookiecutter-github-control"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["hiera-aws-sm"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "hiera-aws-sm"
        name                        = "hiera-aws-sm"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["homebrew-infrahouse-toolkit"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "homebrew-infrahouse-toolkit"
        name                        = "homebrew-infrahouse-toolkit"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["infrahouse-com"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "infrahouse-com"
        name                        = "infrahouse-com"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["infrahouse-puppet-data"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "infrahouse-puppet-data"
        name                        = "infrahouse-puppet-data"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["infrahouse-toolkit"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "infrahouse-toolkit"
        name                        = "infrahouse-toolkit"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["infrahouse-website-infra"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "infrahouse-website-infra"
        name                        = "infrahouse-website-infra"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["prometheus-elasticsearch-exporter"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "prometheus-elasticsearch-exporter"
        name                        = "prometheus-elasticsearch-exporter"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["proxysql-sandbox"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "proxysql-sandbox"
        name                        = "proxysql-sandbox"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["puppet-code"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "puppet-code"
        name                        = "puppet-code"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-actions-runner"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-actions-runner"
        name                        = "terraform-aws-actions-runner"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-aerospike"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-aerospike"
        name                        = "terraform-aws-aerospike"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-bookstack"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-bookstack"
        name                        = "terraform-aws-bookstack"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-ci-cd"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-ci-cd"
        name                        = "terraform-aws-ci-cd"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-cloud-init"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-cloud-init"
        name                        = "terraform-aws-cloud-init"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-cost-alert"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-cost-alert"
        name                        = "terraform-aws-cost-alert"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-debian-repo"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-debian-repo"
        name                        = "terraform-aws-debian-repo"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-ecs"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-ecs"
        name                        = "terraform-aws-ecs"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-elasticsearch"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-elasticsearch"
        name                        = "terraform-aws-elasticsearch"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-gh-identity-provider"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-gh-identity-provider"
        name                        = "terraform-aws-gh-identity-provider"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-gha-admin"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-gha-admin"
        name                        = "terraform-aws-gha-admin"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-github-backup"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-github-backup"
        name                        = "terraform-aws-github-backup"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-github-backup-configuration"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-github-backup-configuration"
        name                        = "terraform-aws-github-backup-configuration"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-github-role"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-github-role"
        name                        = "terraform-aws-github-role"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-instance-profile"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-instance-profile"
        name                        = "terraform-aws-instance-profile"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-jumphost"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-jumphost"
        name                        = "terraform-aws-jumphost"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-kibana"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-kibana"
        name                        = "terraform-aws-kibana"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-openvpn"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-openvpn"
        name                        = "terraform-aws-openvpn"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-postfix"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-postfix"
        name                        = "terraform-aws-postfix"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-pypiserver"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-pypiserver"
        name                        = "terraform-aws-pypiserver"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-secret"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-secret"
        name                        = "terraform-aws-secret"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-secret-policy"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-secret-policy"
        name                        = "terraform-aws-secret-policy"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-service-network"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-service-network"
        name                        = "terraform-aws-service-network"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-state-bucket"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-state-bucket"
        name                        = "terraform-aws-state-bucket"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-state-manager"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-state-manager"
        name                        = "terraform-aws-state-manager"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-tags-override"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-tags-override"
        name                        = "terraform-aws-tags-override"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-terraformer"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-terraformer"
        name                        = "terraform-aws-terraformer"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-update-dns"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-update-dns"
        name                        = "terraform-aws-update-dns"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-website-pod"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "terraform-aws-website-pod"
        name                        = "terraform-aws-website-pod"
      ~ web_commit_signoff_required = true -> false
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 46 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogNywgImNoYW5nZSI6IDQ2LCAiZGVzdHJveSI6IDF9fQ==
```
</details>